// StudyC++.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
void foo() {
	static unsigned char  A;
	A = 255;
	do {
		A++;
	} while (A != 0);
}

void foo2() {
	static signed __int8 A;
	A = -127;
	while (A < 0)
	{
		A = A - 1;
	}
}
void foo3() {
	static float S;
	static unsigned char N = 11;
	std::cout << "N = " << (int)N << std::endl;
	S = 1. / N;
	while (S != 1)
	{
		std::cout << S << std::endl;
		S += 1. / N;
	}
	std::cout << S << std::endl;
};



//LAB2
//////////////////
int iterAdd(int x, int y) {
	for (int i = 0; i < y; i++) {
		x++;
	}
	return x;
}

int recAdd(int x, int y) {
	if (y == 0) return x;
	return recAdd(x,y-1) + 1;
}

int iterMulty(int x, int y) {
	int res = 0;
	for (int i = 0; i < y; i++) {
		iterAdd(res, x);
	}
	return res;
}

int recMulty(int x, int y) {
	if (y == 0) return 0;
	return recAdd(x, recMulty(x, y - 1));
}

int iterPower(int x, int y) {
	int res = 1;
	for (int i = 0; i < y; i++) {
		res = iterMulty(res, x);
	}
	return res;
}

int recPower(int x, int y) {
	if (y == 0) return 1;
	return recMulty(x, recPower(x, y - 1));
}

int foo4(int n) {
	if (n <= 2) return 1;
	return foo4(n - 2) + foo4(n - 1);
}

int foo5(int n) {
	int a = 1;
	int last = 0;
	int b = 0;
	for (int i = 0; i < n - 1; i++) {
		last = a;
		a = a + b;
		b = last;
	}
	return a;
}

int fooM(int n) {
	if (n > 100) return n - 10;
	return fooM(fooM(n + 11));
}

int fooA(int m, int n) {
	if (m == 0) return n + 1;
	else if (n == 0) return fooA(m - 1, 1);
	else return fooA(m - 1, fooA(m, n - 1));
}

char picture[17][17] = {
	{ ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',' '},
	{ ' ', ' ', ' ', ' ', ' ', '@', '@', '@', ' ', '@', '@', '@', ' ', ' ', ' ', ' ',' '},
	{ ' ', ' ', ' ', ' ', '@', ' ', ' ', '@', '@', '@', ' ', ' ', '@', ' ', ' ', ' ',' '},
	{ ' ', ' ', ' ', '@', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '@', ' ', ' ',' '},
	{ ' ', ' ', '@', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '@', ' ',' '},
	{ ' ', '@', ' ', ' ', ' ', ' ', ' ', '@', '@', '@', ' ', ' ', ' ', ' ', ' ', '@',' '},
	{ ' ', '@', ' ', ' ', ' ', ' ', '@', ' ', ' ', ' ', '@', ' ', ' ', ' ', ' ', '@',' '},
	{ ' ', '@', ' ', ' ', ' ', ' ', '@', ' ', ' ', ' ', '@', ' ', ' ', ' ', ' ', '@',' '},
	{ ' ', '@', ' ', ' ', ' ', ' ', '@', ' ', ' ', ' ', '@', ' ', ' ', ' ', ' ', '@',' '},
	{ ' ', '@', ' ', ' ', ' ', ' ', '@', ' ', ' ', ' ', '@', ' ', ' ', ' ', ' ', '@',' '},
	{ ' ', '@', ' ', ' ', ' ', ' ', '@', ' ', ' ', ' ', '@', ' ', ' ', ' ', ' ', '@',' '},
	{ ' ', '@', ' ', ' ', ' ', ' ', ' ', '@', '@', '@', ' ', ' ', ' ', ' ', ' ', '@',' '},
	{ ' ', '@', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '@',' '},
	{ ' ', '@', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '@',' '},
	{ ' ', '@', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '@',' '},
	{ ' ', '@', '@', '@', '@', '@', '@', '@', '@', '@', '@', '@', '@', '@', '@', '@',' '},
	{ ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',' '},
};

char picture2[17][17] = {
	{ ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',' '},
	{ ' ', ' ', ' ', ' ', ' ', '@', '@', '@', ' ', '@', '@', '@', ' ', ' ', ' ', ' ',' '},
	{ ' ', ' ', ' ', ' ', '@', ' ', ' ', '@', '@', '@', ' ', ' ', '@', ' ', ' ', ' ',' '},
	{ ' ', ' ', ' ', '@', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '@', ' ', ' ',' '},
	{ ' ', ' ', '@', ' ', '@', '@', '@', '@', ' ', ' ', ' ', ' ', ' ', ' ', '@', ' ',' '},
	{ ' ', '@', ' ', '@', ' ', ' ', ' ', '@', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '@',' '},
	{ ' ', '@', ' ', '@', ' ', ' ', ' ', '@', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '@',' '},
	{ ' ', '@', ' ', '@', ' ', ' ', ' ', '@', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '@',' '},
	{ ' ', '@', ' ', '@', ' ', ' ', ' ', '@', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '@',' '},
	{ ' ', '@', ' ', '@', ' ', ' ', ' ', '@', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '@',' '},
	{ ' ', '@', ' ', '@', ' ', ' ', ' ', '@', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '@',' '},
	{ ' ', '@', ' ', ' ', '@', '@', '@', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '@',' '},
	{ ' ', '@', '@', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '@',' '},
	{ ' ', '@', '@', '@', '@', '@', '@', '@', '@', '@', '@', '@', '@', '@', '@', '@',' '},
	{ ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',' '},
	{ ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',' '},
	{ ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',' '},
};

void FILL(int x, int y, char border, char filColor) {
	char c;
	c = picture2[x][y];
	if (c != border and c != filColor) {
		picture2[x][y] = filColor;
		FILL(x - 1, y, border, filColor);
		FILL(x + 1, y, border, filColor);
		FILL(x, y - 1, border, filColor);
		FILL(x, y + 1, border, filColor);
	}
}

int main()
{	
	std::cout << recAdd(4, 2) << std::endl;
	std::cout << recMulty(4, 2) << std::endl;
	std::cout << recPower(4, 2) << std::endl;


	int n = 17;
	for (unsigned i = 0; i < n; ++i)
	{
		for (unsigned j = 0; j < n; ++j)
			std::cout << picture2[i][j] << " ";
		std::cout << "\n";
	}
	// 9 3
	// 2 5
	FILL(2,5,'@','0');
	for (unsigned i = 0; i < n; ++i)
	{
		for (unsigned j = 0; j < n; ++j)
			std::cout << picture2[i][j] << " ";
		std::cout << "\n";
	}
	std::cout;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
